Процедура ОбработкаПроведения(Отказ, Режим)

    Движения.ОстаткиТоваров.Записывать = Истина;
    Движения.Продажи.Записывать = Истина;
    Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
    
    Запрос.Текст = "ВЫБРАТЬ
                   |	СУММА(ОстаткиТоваровОстатки.КоличествоОстаток) КАК КоличествоОстаток,
                   |	РеализацияТовары.Товар КАК Товар,
                   |	СУММА(РеализацияТовары.Количество) КАК Количество,
                   |	СУММА(РеализацияТовары.Сумма) КАК Сумма
                   |ИЗ
                   |	Документ.Реализация.Товары КАК РеализацияТовары
                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени, ) КАК ОстаткиТоваровОстатки
				   |		ПО (ОстаткиТоваровОстатки.Товар = РеализацияТовары.Товар)
                   |ГДЕ
                   |	РеализацияТовары.Ссылка = &Ссылка
                   |
                   |СГРУППИРОВАТЬ ПО
                   |	РеализацияТовары.Товар";    

    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

        // Регистр ОстаткиТоваров - Расход
        Движение = Движения.ОстаткиТоваров.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = Дата;
        Движение.Товар = ВыборкаДетальныеЗаписи.Товар;
        Движение.Количество = ВыборкаДетальныеЗаписи.Количество;

        // Регистр Продажи
        Движение = Движения.Продажи.Добавить();
        Движение.Период = Дата;
        Движение.Товар = ВыборкаДетальныеЗаписи.Товар;
        Движение.Контрагент = Контрагент;
        Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
        Движение.Выручка = ВыборкаДетальныеЗаписи.Сумма;
        Движение.Себестоимость = 0;

        // Проверка отрицательных остатков
        Если Режим = РежимПроведенияДокумента.Оперативный Тогда
            Если ВыборкаДетальныеЗаписи.КоличествоОстаток < 0 Тогда
                Сообщение = Новый СообщениеПользователю();
                Сообщение.Текст = "Не хватает "
                    + Строка(-ВыборкаДетальныеЗаписи.КоличествоОстаток)
                    + " единиц товара: "
                    + ВыборкаДетальныеЗаписи.Товар;
                Сообщение.Сообщить();
                Отказ = Истина;
            КонецЕсли;
        КонецЕсли;

    КонецЦикла;

КонецПроцедуры