Процедура ОбработкаПроведения(Отказ, Режим)

    Движения.ОстаткиТоваров.Записывать = Истина;
    Движения.Продажи.Записывать = Истина;

    Для Каждого ТекСтрокаТовары Из Товары Цикл

        // Регистр ОстаткиТоваров - Расход
        Движение = Движения.ОстаткиТоваров.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = Дата;
        Движение.Товар = ТекСтрокаТовары.Товар;
        Движение.Количество = ТекСтрокаТовары.Количество;

        // Регистр Продажи - Оборот
        Движение = Движения.Продажи.Добавить();
        Движение.Период = Дата;
        Движение.Товар = ТекСтрокаТовары.Товар;
        Движение.Контрагент = Контрагент;
        Движение.Количество = ТекСтрокаТовары.Количество;
        Движение.Выручка = ТекСтрокаТовары.Сумма;
        Движение.Себестоимость = 0;

    КонецЦикла;

КонецПроцедуры