&НаКлиенте
Процедура РассчитатьСумму(СтрокаТабличнойЧасти)
    СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
    СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
    РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
    СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
    РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуТовара(Товар)
    Отбор = Новый Структура("Товар", Товар);
    ЗначенияРесурсов = РегистрыСведений.Цена.ПолучитьПоследнее(, Отбор);
    Возврат ЗначенияРесурсов.Цена;
КонецФункции

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
    СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
    СтрокаТабличнойЧасти.Цена = ПолучитьЦенуТовара(СтрокаТабличнойЧасти.Товар);
    РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры